app/controllers/users_controller.rb

  def index
    @title = "All users"
    @users = User.paginate(:page => params[:page])
---
SELECT COUNT(*) FROM `users`
SELECT `users`.* FROM `users` LIMIT 30 OFFSET 0

  def create
    @user = User.new(params[:user])
    if @user.save
---
INSERT INTO `users` (`email`, `encrypted_password`, `salt`, `updated_at`, `admin`, `name`, `created_at`) VALUES ('horst@wurst.com', '4998e5e3e60cd58e6a662c1572b81cca1e185ca275ea48718afaca29a41d8b79', '61b2f1a57d5d31c11bbfa2306fd63f73bfb84bdf12eaa6f619616dbe9b7e50b2', '2011-02-11 07:25:02', NULL, 'Horst', '2011-02-11 07:25:02')

  def update
    if @user.update_attributes(params[:user])
---
UPDATE `users` SET `updated_at` = '2011-02-10 11:31:54', `encrypted_password` = 'e3e881bb8e9971f994aa0429f706f022457afc4086651c1695fb8c4a468cc43c' WHERE (`users`.`id` = 2)